#!/usr/bin/python
# -*- coding: iso-8859-15 -*-

class Ua():
	teens = {1: 'одна ', 2: 'дві ', 3 : 'три ', 4: 'чотири ', 5: 'п\'ять ', 6: 'шість ', 7: 'сім ', 8: 'вісім ', 
	 9: "дев'ять ", 10: 'десять ', 11: 'одинадцять ', 12: 'дванадцять ', 13: 'тринадцять ', 14: 'чотирнадцять ',
	 15: "п'ятнадцять ", 16: 'шістнадцять ', 17: 'сімнадцять ', 18: 'вісімнадцять ', 19: "дев'ятнадцять "}
	dozens = {2: 'двадцять ', 3: 'тридцять ', 4: 'сорок ', 5: "п'ятдесят ", 6: 'шістдесят ', 7: 'сімдесят ',
	 8: 'вісімдесят ', 9: "дев'яносто "}
	hundreds = {1: 'сто ', 2: 'двісті ', 3: 'триста ', 4: 'чотириста ', 5: "п'ятсот ", 6: 'шістсот ', 7: 'сімсот ',
	 8: 'вісімсот ', 9: "дев'ятсот "}
	uper_mln_case = {1: 'один ', 2: 'двa '}
	currency = 'грив'
	coins = 'копій'
	level = {1: 'тисяч', 2: 'мільйон', 3: 'мільярд', 4: 'трильйон', 5: 'квадрильйон'}
	endings = {0: ' ', 1: 'и ', 2: 'ів ', 3: 'ня', 4: 'ні', 5: 'ень', 6: 'ка ', 7: 'ки ', 8: 'ок ', 9: 'a ',
	 10: 'і '}
		