#!/usr/bin/python
# -*- coding: iso-8859-15 -*-

preffix = 'ru'

teens = {1: 'один ', 2: 'двa ', 3 : 'три ', 4: 'четыре ', 5: 'пять ', 6: 'шесть ', 7: 'сем ', 8: 'восем ', 
 9: "девять ", 10: 'десять ', 11: 'одиннадцать ', 12: 'двенадцять ', 13: 'тринадцять ', 14: 'четырнадцять ',
 15: "пятнадцять ", 16: 'шестнадцять ', 17: 'семнадцять ', 18: 'восемнадцять ', 19: "девятнадцять "}
dozens = {2: 'двадцять ', 3: 'тридцять ', 4: 'сорок ', 5: "пятдесят ", 6: 'шестдесят ', 7: 'семдесят ',
 8: 'восемдесят ', 9: "девяносто "}
hundreds = {1: 'сто ', 2: 'двесте ', 3: 'триста ', 4: 'четыриста ', 5: 'пятсот ', 6: 'шестсот ', 7: 'семсот ',
 8: 'восемсот ', 9: "девятсот "}
cpecial_case = {1: 'одна ', 2: 'две '}
currency_uah = 'грив'
currency_rub = 'руб'
currency_eur = 'евро'
currency_usd = 'доллар'
coins = 'копей'
coins_cent = 'цент'
level = {1: 'тысяч', 2: 'миллион', 3: 'миллиард', 4: 'триллион', 5: 'квадриллион'}
currency_endings_uah = ['ня', 'ны', 'ень'] 
currency_endings_rub = ['ель', 'ля', 'лей']
currency_endings_eur = ['', '', '']
thousand_endings = ['a ', 'и ', ' ']
upper_mln_endings = [' ', 'а ', 'ов ']
currency_endings_usd = ['', 'а', 'ов']
coins_endings = ['ка', 'ки', 'ек']

CURRENCIES = ['eur', 'rub', 'uah', 'usd']
