#!/usr/bin/python
# -*- coding: iso-8859-15 -*-

preffix = 'ua'

teens_ua = {1: 'один ', 2: 'двa ', 3 : 'три ', 4: 'чотири ', 5: 'п\'ять ', 6: 'шість ', 7: 'сім ', 8: 'вісім ', 
 9: "дев'ять ", 10: 'десять ', 11: 'одинадцять ', 12: 'дванадцять ', 13: 'тринадцять ', 14: 'чотирнадцять ',
 15: "п'ятнадцять ", 16: 'шістнадцять ', 17: 'сімнадцять ', 18: 'вісімнадцять ', 19: "дев'ятнадцять "}
dozens_ua = {2: 'двадцять ', 3: 'тридцять ', 4: 'сорок ', 5: "п'ятдесят ", 6: 'шістдесят ', 7: 'сімдесят ',
 8: 'вісімдесят ', 9: "дев'яносто "}
hundreds_ua = {1: 'сто ', 2: 'двісті ', 3: 'триста ', 4: 'чотириста ', 5: "п'ятсот ", 6: 'шістсот ', 7: 'сімсот ',
 8: 'вісімсот ', 9: "дев'ятсот "}
cpecial_case_ua = {1: 'одна ', 2: 'дві '}
currency_uah = 'грив'
currency_rub = 'руб'
currency_eur = 'євро'
currency_usd = 'доллар'
coins = 'копій'
coins_cent = 'цент'
level = {1: 'тисяч', 2: 'мільйон', 3: 'мільярд', 4: 'трильйон', 5: 'квадрильйон'}
currency_endings_uah = ['ня', 'ні', 'ень'] 
currency_endings_rub = ['ль', 'лі', 'лів']
currency_endings_eur = ['', '', '']
thousand_endings = ['a ', 'і ', ' ']
upper_mln_endings = [' ', 'и ', 'ів ']
currency_endings_usd = ['', 'и', 'ів']
coins_endings = ['ка', 'ки', 'ок']

CURRENCIES = ['eur', 'rub', 'uah', 'usd']
